#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f52e2b77-0da6-4e3f-a2ff-6f559c4e6c7c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=18510fcb-ee80-41fb-92c3-d157d51ae5bc]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e3e15e97-426b-4cd8-83fe-32cdfc8e37d9]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b31286d0-02b1-4817-8050-77945247f967]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3037.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=abcbe85e-df8c-47ce-a7ab-d2a6a8dfe75e]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=044874c2-6431-48ae-8406-6f7b8458a0e3]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=57b3f858-b7ef-4126-8e0d-bc5605c0504c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=65874df5-8751-49f2-abc2-e261d86f6cb5]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-feb-1-4885.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1505ede9-97cb-4b02-951e-57b9c006331b]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f9d3716d-da09-47ea-8673-9231e14bb31b]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=16484d85-e7b3-4be0-8c7c-6f204a3da0eb]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a3b88f38-15dc-4b4a-baec-c6579630644c]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=15d88449-bc0d-426e-81b0-6a4695f26aac]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=58fa0b6a-e5bc-4425-83a5-a6d702ca3276]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=96b39fd8-c1c8-42f4-bb64-b767e67e44c9]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c543e7e2-a624-44fa-a5cb-37d8b5da2cdf]
module.keycloak_dev.module.onestopauth_basic.module.client_testprojectjunmin-2222-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b24fc842-4228-4c11-bfda-725ff2e436dd]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6c4f57b5-6814-4ac6-8466-25917eb885ac]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d17dd5ab-c7e4-4ab9-b50d-433d2ab0db07]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b603cd1d-36d0-4ee3-b92b-12d65a308112]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1228035e-160a-4059-be47-ad2fdd3f6d2a]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d5147dd4-259c-4487-bbbf-9b7ea87f314c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1bed6e2e-ba8e-435c-994a-dd229a49f9d1]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=41a127b0-5114-46c6-bea6-47c40ad6e18d]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-3004.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=9d8510bc-7f2c-49ab-83a2-099dd23eaf99]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ae454372-19c8-4093-87b5-154ad6f86588]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cb6f72bb-4325-433a-9579-261210291fc3]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a12d229c-f65f-49f5-b1a0-4bebda10e03c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ae671e67-97e8-4b38-8f19-df1556cc24eb]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=62986da8-6133-421e-bed4-14cd0bb9f48e]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7302304e-4c40-47f9-9da0-bdff8e0553e2]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0652ce91-1e75-42ce-8966-465816dc9ad9]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=cb52b8da-11cd-4fe7-a4a5-de06310c7e19]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b83ebb29-7401-4cab-9251-875c00611c7d]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=67d6d396-9e6a-4904-a3c9-d8f1ff697235]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=75f152fc-ed9f-409d-bce8-0035c0d895c3]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5fbabd38-1d26-44f9-8086-9b675782ebad]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=966222d7-7d28-4ad1-9f67-d9dda46754e4]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d97d4f3a-8a4c-4a1a-ad6f-0fed80f5d66c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dbcd40f7-b57e-448b-9668-93bed4daf83f]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1cbd40db-e353-40a4-a860-fad0423eb01a]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bc59ddfc-f011-43ac-bfb4-554d07506edc]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=026e79a6-549b-4d4a-985f-ca82c23927a2]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bfe0a642-272e-4dc6-bceb-c74311c94cef]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7ed73078-f49e-4471-b56c-5313a5e461af]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f4290d21-f42e-402d-83da-abc8d4041fdb]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5aca37af-a5cf-4589-a5d4-500e31638bbe]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=17b06bb4-7de4-4441-8737-675325c9d815]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b226bb3a-643e-42f8-b270-eb8c81d737a0]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=283ecfe9-1c7b-4a54-b6e9-a8c6c3f234be]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6205b812-8af3-4df4-8e98-776289573bd4]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c398ff2d-2227-4de0-ab41-60c9b3bcbf61]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d5d2af1d-f1d8-4291-b46a-fe590bb3a2d7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f9f98243-d304-4942-9acb-1f529fee9b82]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=281222ef-5ba9-49d6-b755-d3337d7d9201]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=09d5f50c-87c4-4ef6-816d-7fd60d1ee4c1]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=177d4a0c-39d1-40cf-994b-a4e0528ab75c]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cf92d72a-c9fa-49f5-921f-d152dc7e6ed7]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-no-prod-3103.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d6026de8-3eee-4aba-a5fe-96a9bcfa0826]
module.keycloak_dev.module.onestopauth_basic.module.client_bceid-testzorin-2707.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=144504cf-24e8-4d75-981b-35dcb9dfa993]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2f7e3930-cf59-430e-a675-78cfb092d685]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=802cd761-f519-45cc-97d4-024e3cb7f8b7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=09da8d35-2321-41e1-8426-6537bd712ae7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=1c0d6ed1-4c9c-4d2e-b6ec-6cb3bcd69066]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=893c5928-8dcf-407c-954c-147df4dbbec6]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fc75240d-2577-4ef3-9b83-67a00b42ec3b]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-2806.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7a049900-08f0-455d-8e60-117d6b1b65e8]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=49470a5b-df0e-4461-9937-98bc92169d12]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=699e8064-a4e6-4432-b5aa-e5bdbbcac8bb]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3d317744-172f-4573-8baf-3812a2493578]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4602c64b-fdf5-439d-8dfd-94b2a2d87c5e]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=235ae496-9ddc-4276-b295-d20ddaf975c7]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4d8793e2-7000-4f0b-85c9-ee9c4be687cb]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8b159a9c-9fd3-4b91-99c8-a9c0137e4c8b]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=866dfed7-4420-44da-9583-ab73ec94f1e6]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=9ee4aef4-74f4-40b2-8d50-ae2408f52f2b]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=510bcaef-7de4-422f-801f-495a523d5d11]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=19a6e226-0f97-40bf-8249-86b3b1cfd90a]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4d1ee7f4-dc06-497d-b305-599d58985448]
module.keycloak_dev.module.onestopauth_basic.module.client_start-b-cei-d-dev-3302.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=86720f10-ba81-4365-85cd-599b79f258dc]
module.keycloak_dev.module.onestopauth_basic.module.client_zz-3468.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d8778526-a35a-471b-a951-bb1e04fabbf1]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth.module.client_feb-2-test-team-access-to-json-4918.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "3b8a90dc-f5bd-4a7f-a5cb-56a881a685ba"
        name                                     = "feb-2-test-team-access-to-json-4918"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "feb-3-test-team-access-to-files-4951"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "feb-3-test-team-access-to-files-4951"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.test.ca",
        ]
      + web_origins                              = [
          + "+",
          + "http://www.test.ca",
        ]
    }

  # module.keycloak_dev.module.onestopauth.module.client_temp-7.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "temp-7"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_temp-7.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_temp-7.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_temp-7.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_temp-7.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "temp-7"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_temp-7.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_temp-7.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_temp-7.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_temp-7.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "temp-7"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "temp-7"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
        ]
      + web_origins                              = [
          + "+",
          + "http://localhost:3000",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3456 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*